Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 960, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 960, 30) 840         input_1[0][0]                    
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 512, 960, 30) 60          conv2d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         multiple             0           instance_normalization[0][0]     
                                                                 instance_normalization_1[0][0]   
                                                                 instance_normalization_2[0][0]   
                                                                 instance_normalization_3[0][0]   
                                                                 instance_normalization_4[0][0]   
                                                                 instance_normalization_5[0][0]   
                                                                 instance_normalization_6[0][0]   
                                                                 instance_normalization_7[0][0]   
                                                                 instance_normalization_8[0][0]   
                                                                 instance_normalization_9[0][0]   
                                                                 instance_normalization_10[0][0]  
                                                                 instance_normalization_11[0][0]  
                                                                 instance_normalization_12[0][0]  
                                                                 instance_normalization_13[0][0]  
                                                                 instance_normalization_14[0][0]  
                                                                 instance_normalization_15[0][0]  
                                                                 instance_normalization_16[0][0]  
                                                                 instance_normalization_17[0][0]  
                                                                 instance_normalization_18[0][0]  
                                                                 instance_normalization_19[0][0]  
                                                                 instance_normalization_20[0][0]  
                                                                 instance_normalization_21[0][0]  
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 960, 30) 8130        leaky_re_lu[0][0]                
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 512, 960, 30) 60          conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 256, 480, 30) 0           leaky_re_lu[1][0]                
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 480, 60) 16260       max_pooling2d[0][0]              
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 256, 480, 60) 120         conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 480, 60) 32460       leaky_re_lu[2][0]                
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 256, 480, 60) 120         conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 128, 240, 60) 0           leaky_re_lu[3][0]                
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 240, 120 64920       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 128, 240, 120 240         conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 240, 120 129720      leaky_re_lu[4][0]                
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 128, 240, 120 240         conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 64, 120, 120) 0           leaky_re_lu[5][0]                
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 120, 240) 259440      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 64, 120, 240) 480         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 120, 240) 518640      leaky_re_lu[6][0]                
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 64, 120, 240) 480         conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 32, 60, 240)  0           leaky_re_lu[7][0]                
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 60, 320)  691520      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 32, 60, 320)  640         conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 60, 320)  921920      leaky_re_lu[8][0]                
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 32, 60, 320)  640         conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 16, 30, 320)  0           leaky_re_lu[9][0]                
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 30, 320)  921920      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 16, 30, 320)  640         conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 30, 320)  921920      leaky_re_lu[10][0]               
__________________________________________________________________________________________________
instance_normalization_11 (Inst (None, 16, 30, 320)  640         conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 32, 60, 320)  409920      leaky_re_lu[11][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 32, 60, 640)  0           conv2d_transpose[0][0]           
                                                                 leaky_re_lu[9][0]                
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 60, 320)  1843520     concatenate[0][0]                
__________________________________________________________________________________________________
instance_normalization_12 (Inst (None, 32, 60, 320)  640         conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 60, 320)  921920      leaky_re_lu[12][0]               
__________________________________________________________________________________________________
instance_normalization_13 (Inst (None, 32, 60, 320)  640         conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 64, 120, 240) 307440      leaky_re_lu[13][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 120, 480) 0           conv2d_transpose_1[0][0]         
                                                                 leaky_re_lu[7][0]                
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 120, 240) 1037040     concatenate_1[0][0]              
__________________________________________________________________________________________________
instance_normalization_14 (Inst (None, 64, 120, 240) 480         conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 120, 240) 518640      leaky_re_lu[14][0]               
__________________________________________________________________________________________________
instance_normalization_15 (Inst (None, 64, 120, 240) 480         conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 128, 240, 120 115320      leaky_re_lu[15][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 240, 240 0           conv2d_transpose_2[0][0]         
                                                                 leaky_re_lu[5][0]                
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 128, 240, 120 259320      concatenate_2[0][0]              
__________________________________________________________________________________________________
instance_normalization_16 (Inst (None, 128, 240, 120 240         conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 128, 240, 120 129720      leaky_re_lu[16][0]               
__________________________________________________________________________________________________
instance_normalization_17 (Inst (None, 128, 240, 120 240         conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 256, 480, 60) 28860       leaky_re_lu[17][0]               
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 480, 120 0           conv2d_transpose_3[0][0]         
                                                                 leaky_re_lu[3][0]                
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 256, 480, 60) 64860       concatenate_3[0][0]              
__________________________________________________________________________________________________
instance_normalization_18 (Inst (None, 256, 480, 60) 120         conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 256, 480, 60) 32460       leaky_re_lu[18][0]               
__________________________________________________________________________________________________
instance_normalization_19 (Inst (None, 256, 480, 60) 120         conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 512, 960, 30) 7230        leaky_re_lu[19][0]               
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 512, 960, 60) 0           conv2d_transpose_4[0][0]         
                                                                 leaky_re_lu[1][0]                
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 512, 960, 30) 16230       concatenate_4[0][0]              
__________________________________________________________________________________________________
instance_normalization_20 (Inst (None, 512, 960, 30) 60          conv2d_20[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 512, 960, 30) 8130        leaky_re_lu[20][0]               
__________________________________________________________________________________________________
instance_normalization_21 (Inst (None, 512, 960, 30) 60          conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 512, 960, 10) 310         leaky_re_lu[21][0]               
==================================================================================================
Total params: 10,196,050
Trainable params: 10,196,050
Non-trainable params: 0
__________________________________________________________________________________________________
